"""
Практическая работа 1: Загрузка изображения и получение информации о нём
Дисциплина: Математические методы распознавания образов
Выполнил: студент группы 12-25РПм, Дмитрий Трифонов

Для проверки положить в любую папку и выполнить:
python 1-1_Trifonov_MMRO_PR1.py
"""

# Импортируем необходимые модули
from PIL import Image                         # Модуль для работы с изображениями
import io                                     # Модуль для работы с бинарными потоками (BytesIO)

# 1. Открытие изображения из текущей папки
img1 = Image.open("1-2_Trifonov_MMRO_PR1.jpg")

# 2. Открытие изображения в бинарном режиме и конвертация в оттенки серого
img2 = Image.open("1-2_Trifonov_MMRO_PR1.jpg")  
img2 = img2.convert("L")       

# 3. Открытие изображения через файловый объект
f = open("1-2_Trifonov_MMRO_PR1.jpg", "rb")   # Открываем файл в бинарном режиме
img3 = Image.open(f)                          # Передаем объект файла в Image.open
f.close()                                     # Закрываем файл после использования

# 4. Загрузка изображения из бинарного потока с использованием BytesIO
with open("1-2_Trifonov_MMRO_PR1.jpg", "rb") as file:          
    img_bytes = file.read()                   # Читаем бинарные данные файла
    img4 = Image.open(io.BytesIO(img_bytes))  # Создаем изображение из бинарного потока
    img4 = img4.convert("L")                  # Конвертируем в черно-белое
    img4.show()

# 5. Выбираем изображение для анализа (например, img1)
img = img1

# 6. Полная информация об изображении
print("\n==== ==== ==== ====\nИнформация об изображении:", img.info)

# 7. Цветовая модель изображения (RGB, L, CMYK и т.д.)
print("Цветовая модель:", img.mode)

# 8. Размер изображения (ширина, высота)
print("Размер изображения:", img.size)

# 9. Координаты области, в которую вписывается всё изображение
print("Прямоугольная область (bounding box):", img.getbbox())

# 10. Полная информация об изображении
print("Информация об изображении:", img.format, '\n==== ==== ==== ====')
